Revit 2016 API
LineLoad.Force1 Property
 Returns the three dimensional force applied to the start point of the line load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2016. Use ForceVector1 instead.")]
public XYZ Force1 { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2016. Use ForceVector1 instead.")> _
Public ReadOnly Property Force1 As XYZ
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2016. Use ForceVector1 instead.")]
public:
property XYZ^ Force1 {
	XYZ^ get ();
}
Remarks
 The default force unit is kN/m for metric, and kip/ft for imperial.
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace